app/Http/Controllers/HomePageController.php

    public function index(Request $request)
    {
        $perusahaan = Perusahaan::whereNull('deleted_at')->count();
        $berita = Berita::whereNull('deleted_at')->orderBy('tanggal_berita', 'DESC')->take(3)->get();

        // dd(__("message.Tentang"));

        // $layanan = TKonsultasi::whereNull('deleted_at')->count();
        $layanan = DB::table('t_konsultasi as ta')
        ->leftJoin('m_perusahaan as tb', 'ta.id_perusahaan', '=', 'tb.id')
        ->whereNull('ta.deleted_at')
        ->whereNull('tb.deleted_at')
        ->count();

        $topik = DB::table('t_konsultasi as ta')
        ->leftJoin('t_konsultasi_topik as td', 'ta.id', '=', 'td.id_konsultasi')
        ->leftJoin('m_topik as tb', 'td.id_topik', '=', 'tb.id')
        ->select(\DB::raw('count(td.id_topik) as total, tb.nama_topik'))
        ->whereNull('ta.deleted_at')
        ->groupBy('tb.id')
        ->get();

        if ($request->ajax()) {
            return Datatables::of($topik)
            ->addIndexColumn()
            ->make(true);
        }

        $export = DB::table('t_p_export as ta')
        ->leftJoin('m_perusahaan as tb', 'ta.id_perusahaan', '=', 'tb.id')
        ->select(\DB::raw('sum(ta.nilai_transaksi) as total'))
        ->whereNull('ta.deleted_at')
        ->whereNull('tb.deleted_at')
        ->first();
---
select count(*) as aggregate from `m_perusahaan` where `deleted_at` is null and `m_perusahaan`.`deleted_at` is null
select * from `m_berita` where `deleted_at` is null and `m_berita`.`deleted_at` is null order by `tanggal_berita` desc limit 3
select count(*) as aggregate from `t_konsultasi` as `ta` left join `m_perusahaan` as `tb` on `ta`.`id_perusahaan` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null
select count(td.id_topik) as total, tb.nama_topik from `t_konsultasi` as `ta` left join `t_konsultasi_topik` as `td` on `ta`.`id` = `td`.`id_konsultasi` left join `m_topik` as `tb` on `td`.`id_topik` = `tb`.`id` where `ta`.`deleted_at` is null group by `tb`.`id`
select sum(ta.nilai_transaksi) as total from `t_p_export` as `ta` left join `m_perusahaan` as `tb` on `ta`.`id_perusahaan` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null limit 1

        ->orderBy('ta.tanggal_bm', 'ASC')
        ->first();

        $bm = TBm::whereNull('deleted_at')->count();
---
select count(*) as aggregate from `t_bm` where `deleted_at` is null and `t_bm`.`deleted_at` is null

    public function data_topik(Request $request) {

        $topik = DB::table('t_konsultasi as ta')
        ->leftJoin('t_konsultasi_topik as td', 'ta.id', '=', 'td.id_konsultasi')
        ->leftJoin('m_topik as tb', 'td.id_topik', '=', 'tb.id')
        ->select(\DB::raw('count(td.id_topik) as total, tb.nama_topik'))
        ->whereNull('ta.deleted_at')
        ->whereNull('tb.deleted_at')
        ->whereNotNull('tb.id')
        ->groupBy('tb.id')
        ->orderBy('tb.id')
        ->get();
---
select count(td.id_topik) as total, tb.nama_topik from `t_konsultasi` as `ta` left join `t_konsultasi_topik` as `td` on `ta`.`id` = `td`.`id_konsultasi` left join `m_topik` as `tb` on `td`.`id_topik` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null and `tb`.`id` is not null group by `tb`.`id` order by `tb`.`id` asc

    public function section2()
    {
        // $data = TKonsultasi::select(\DB::raw('count(*) as total, MONTH(tanggal_konsultasi) as month'))
        // ->whereNull('deleted_at')
        // ->groupByRaw('MONTH(tanggal_konsultasi)')
        // ->get();
        $data = DB::table('t_konsultasi as ta')
        ->leftJoin('m_perusahaan as tb', 'ta.id_perusahaan', '=', 'tb.id')
        ->select(\DB::raw('count(*) as total, MONTH(ta.tanggal_konsultasi) as month'))
        ->whereNull('ta.deleted_at')
        ->whereNull('tb.deleted_at')
        ->groupByRaw('MONTH(tanggal_konsultasi)')
        ->get();
---
select count(*) as total, MONTH(ta.tanggal_konsultasi) as month from `t_konsultasi` as `ta` left join `m_perusahaan` as `tb` on `ta`.`id_perusahaan` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null group by MONTH(tanggal_konsultasi)