app/Http/Controllers/HomeController.php

select count(*) as aggregate from `t_konsultasi` as `ta` left join `m_perusahaan` as `tb` on `ta`.`id_perusahaan` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null
select count(td.id_topik) as total, tb.nama_topik from `t_konsultasi` as `ta` left join `t_konsultasi_topik` as `td` on `ta`.`id` = `td`.`id_konsultasi` left join `m_topik` as `tb` on `td`.`id_topik` = `tb`.`id` where `ta`.`deleted_at` is null group by `tb`.`id`
select sum(ta.nilai_transaksi) as total from `t_p_export` as `ta` left join `m_perusahaan` as `tb` on `ta`.`id_perusahaan` = `tb`.`id` where `ta`.`deleted_at` is null and `tb`.`deleted_at` is null limit 1
---
    public function index(Request $request) {
        if(Auth::check()) {
            if(Auth::user()->roleuser == "Admin") {
                $perusahaan = Perusahaan::all()->whereNull('deleted_at')->count();

                // $layanan = TKonsultasi::all()->whereNull('deleted_at')->count();
                $layanan = DB::table('t_konsultasi as ta')
                ->leftJoin('m_perusahaan as tb', 'ta.id_perusahaan', '=', 'tb.id')
                ->whereNull('ta.deleted_at')
                ->whereNull('tb.deleted_at')
                ->count();

                $topik = DB::table('t_konsultasi as ta')
                ->leftJoin('t_konsultasi_topik as td', 'ta.id', '=', 'td.id_konsultasi')
                ->leftJoin('m_topik as tb', 'td.id_topik', '=', 'tb.id')
                ->select(\DB::raw('count(td.id_topik) as total, tb.nama_topik'))
                ->whereNull('tb.deleted_at')
                ->groupBy('tb.id')
                ->get();

                if ($request->ajax()) {
                    return Datatables::of($topik)
                    ->addIndexColumn()
                    ->make(true);
                }

                $export = DB::table('t_p_export as ta')
                ->leftJoin('m_perusahaan as tb', 'ta.id_perusahaan', '=', 'tb.id')
                ->select(\DB::raw('sum(ta.nilai_transaksi) as total'))
                ->whereNull('ta.deleted_at')
                ->whereNull('tb.deleted_at')
                ->first();