app/Http/Controllers/PerusahaanController.php

select ta.*, tf.nama_kategori_produk, group_concat( th.nama_sub_kategori ) AS sub_kategori, tb.nama_tipe, tc.NAME AS provinsi, td.NAME AS cities from `m_perusahaan` as `ta` left join `m_tipe_perusahaan` as `tb` on `ta`.`id_tipe` = `tb`.`id` left join `indonesia_provinces` as `tc` on `ta`.`id_provinsi` = `tc`.`code` left join `indonesia_cities` as `td` on `ta`.`id_kabkota` = `td`.`code` left join `m_k_produk` as `tf` on `ta`.`id_kategori_produk` = `tf`.`id` left join `t_sub_kategori_perusahaan` as `tg` on `tg`.`id_perusahaan` = `ta`.`id` left join `m_sub_kategori` as `th` on `tg`.`id_sub_kategori` = `th`.`id` where `ta`.`deleted_at` is null group by `ta`.`id` order by `ta`.`id` asc
select ta.*, tf.nama_kategori_produk, group_concat( th.nama_sub_kategori ) AS sub_kategori, tb.nama_tipe, tc.NAME AS provinsi, td.NAME AS cities from `m_perusahaan` as `ta` left join `m_tipe_perusahaan` as `tb` on `ta`.`id_tipe` = `tb`.`id` left join `indonesia_provinces` as `tc` on `ta`.`id_provinsi` = `tc`.`code` left join `indonesia_cities` as `td` on `ta`.`id_kabkota` = `td`.`code` left join `m_k_produk` as `tf` on `ta`.`id_kategori_produk` = `tf`.`id` left join `t_sub_kategori_perusahaan` as `tg` on `tg`.`id_perusahaan` = `ta`.`id` left join `m_sub_kategori` as `th` on `tg`.`id_sub_kategori` = `th`.`id` where `ta`.`deleted_at` is null and `ta`.`nama_perusahaan` LIKE '%tes%' group by `ta`.`id` order by `ta`.`id` asc
---
    public function index(Request $request)
    {
        $title = 'Delete Perusahaan!';
        $text = "Are you sure you want to delete?";
        // confirmDelete($title, $text);

        if ($request->ajax()) {
            $data = DB::table('m_perusahaan as ta')
            ->leftJoin('m_tipe_perusahaan as tb', 'ta.id_tipe', '=', 'tb.id')
            // ->leftJoin('indonesia_provinces as tc', 'ta.id_provinsi', '=', 'tc.code')
            // ->leftJoin('indonesia_cities as td', 'ta.id_kabkota', '=', 'td.code')
            ->leftJoin('m_k_produk as tf', 'ta.id_kategori_produk', '=', 'tf.id')
            ->leftJoin('t_sub_kategori_perusahaan as tg', 'tg.id_perusahaan', '=', 'ta.id')
            ->leftJoin('m_sub_kategori as th', 'tg.id_sub_kategori', '=', 'th.id')
            ->whereNull('ta.deleted_at');

            if(isset($request->province_id)) {
                $data->where('ta.id_provinsi', '=' , $request->province_id);
            }
            if(isset($request->cities_id)) {
                $data->where('ta.id_kabkota', '=' , $request->cities_id);
            }
            if(isset($request->id_kategori_produk)) {
                $data->where('ta.id_kategori_produk', '=' , $request->id_kategori_produk);
            }
            if(isset($request->id_sub_kategori)) {
                $data->whereIn('tg.id_sub_kategori', $request->id_sub_kategori);
            }
            if(isset($request->searchbox)) {
                $data->where('ta.nama_perusahaan', 'LIKE', '%'. $request->searchbox. '%');